[
    {
        "link": "https://cointelegraph.com/news/lufthansa-eurowings-other-travel-industry-players-push-forward-with-web3",
        "image": "https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=717/https://s3.cointelegraph.com/uploads/2023-05/a71cf127-0c32-4d1d-8cd5-105743703467.jpg",
        "title": "Lufthansa, Eurowings, other travel industry players push forward with Web3",
        "text": "After the recent launch of the Camino Network travel-focused blockchain, legacy travel companies are looking toward a Web3 future. Cointelegraph spoke with executives at Europe-based airlines Lufthansa and Eurowings — two of the first companies to use the Camino Network — to understand how Web3 integrations bring this industry to its next generation."
    },
    {
        "link": "https://markets.businessinsider.com/news/stocks/chain4travel-launches-camino-network-to-implement-web3-in-the-travel-industry-1032294009",
        "image": "http://markets.businessinsider.com/Images/FacebookIcon.jpg",
        "title": "Chain4Travel Launches Camino Network to Implement Web3 in the Travel Industry",
        "text": "The Swiss startup Chain4Travel has announced the launch of the Camino Network mainnet, a public but permissioned blockchain designed for the global travel industry. The company says that the network is backed by major airlines like Lufthansa, Eurowings, Hahn Air, plus a host of other hotel and car rental chains."
    },
    {
        "link": "https://cointelegraph.com/news/travel-goes-web3-how-this-blockchain-is-leading-the-way",
        "image": "https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=717/https://s3.cointelegraph.com/storage/uploads/view/a7def5d324053c5773c4a664746f875a.jpg",
        "title": "Travel goes Web3: How this blockchain is leading the way",
        "text": "Seeing how blockchain can improve the current travel experience for all parties, industry pioneers, stakeholders and Web3 professionals come together to launch an inclusive blockchain ecosystem named Camino Network to pave the way for innovation in the multi-billion dollar industry."
    },
    {
        "link": "https://cryptonews.com/news/why-blockchains-public-permissioned-infrastructure-changing-way-we-do-business.htm",
        "image": "https://v2.cimg.co/news/110827/268245/responsive-images/blockchain___media_library_original_512_283.jpeg",
        "title": "Why Blockchain’s Public and Permissioned Infrastructure Is Changing The Way We Do Business",
        "text": "As technology improves, we are constantly evolving how we interact with each other, with businesses, and this creates both positive and negative effects.  While concepts like AI carry a growing weight of wonder and unease, there are more mundane technologies that are both a foundation for AI-driven progress and that have a greater impact on our daily lives."
    },
    {
        "link": "https://www.traveldailynews.com/technology/travel-tech-provider-triend-sets-new-standard-for-web3-reviews-on-camino-network/",
        "image": "https://www.traveldailynews.com/wp-content/uploads/2023/03/Triend.png",
        "title": "Travel tech provider Triend sets new standard for web3 reviews on Camino Network",
        "text": "There is something profound about transparency. Being able to share what is happening, being able to see what is happening, and being able to ensure that what you see is what you get. This is true in relationships, in public figures, and in business."
    },
    {
        "link": "https://www.travolution.com/news/chain4travel-hits-%E2%82%AC5.2m-target-for-private-pre-sale-of-camino-crypto-tokens/",
        "image": "https://3.cdn.travolution.com/dynamic-images/21000-21999/21753/21753_c=(0,0,2000,1332)_w=800_h=533.webp?v=20220321141806",
        "title": "Chain4Travel hits target for €5.2m private pre-sale of Camino crypto tokens",
        "text": "UK based web3 company, Triend, implements a new standard for travel reviews on the consortium Camino blockchain facilitated by Chain4Travel. This new development will enable more transparent and secure reviews, addressing some of the major problems presented by current review systems."
    },
    {
        "link": "https://skift.com/2022/05/27/swiss-travel-startup-chain4travel-raises-4-5-million/",
        "image": "/static/images/news/news-skift.png",
        "title": "Swiss Travel Startup Chain4Travel Raises $4.5 Million for Blockchain",
        "text": "More than 300 companies and private investors from Europe, Asia, North and South America and Australia participated in the sale"
    },
    {
        "link": "https://skift.com/2022/05/27/swiss-travel-startup-chain4travel-raises-4-5-million/",
        "image": "/static/images/news/news-skift.png",
        "title": "Swiss Travel Startup Chain4Travel Raises $4.5 Million for Blockchain",
        "text": "Chain4Travel raised money to promote blockchain-based travel sales, but the track record of success is short and the technology's comparative advantage over what travel agencies use now remains to be proven."
    },
    {
        "link": "https://www.phocuswire.com/Chain4travel-seed-funding",
        "image": "/static/images/news/news-phocuswire02.png",
        "title": "STARTUP STAGE: Chain4Travel prepares to launch blockchain run by travel industry",
        "text": "Founded by Peakwork CEO Ralf Usbeck, Chain4Travel is the facilitator of the Camino consortium blockchain and has more than 50 supporters from the travel industry. Travel companies can join the presale of the Camino token until Sept. 23. Down the road, Camino will be operated and managed by travel industry partners. To enable this decentralized approach, Chain4Travel AG will transfer the entire intellectual property rights as well as the financial reserves to a dedicated foundation."
    },
    {
        "link": "https://www.phocuswire.com/Chain4travel-seed-funding",
        "image": "/static/images/news/news-phocuswire01.png",
        "title": "Chain4Travel lands £3.6M in funding for blockchain platform",
        "text": "Chain4Travel has raised seed funding of £3.6 million for the development of its blockchain-based travel platform, known as Camino. The Switzerland-based business was launched by Ralf Usbeck, who previously founded TravelTainment and Peakwork, Thomas Stirnimann, former CEO of Hotelplan, and Pablo Castillo, former CIO of Hotelplan."
    }
]

